package curriculamB;

public class Question2 {

	public static void main(String[] args) {
		// TODO 自動生成されたメソッド・スタブ

/*****************************
 *  
 *   【概要】Qes1 int型の変数scoreに75代入
 *   　　　     →scoreが60以上なら合格です！と表示
 *  
 *****************************/
		
		int score = 75;
		
		if(score >= 60) { System.out.println("合格です！");}
		
/*****************************
 *  
 *   【概要】Qes2 int型の変数ageに25を代入
 *   　　　     →ageが20以上30以下なら適正年齢ですと表示
 *   　　　　　 →それ以外の場合は対象外ですと表示
 *  
 *****************************/		
		
		int age = 25;
		
		if(age >= 20 && age <= 30) {
			System.out.println("適正年齢です");
		}else {
			System.out.println("対象外です");
			
		}
		
/*****************************
*  
*   【概要】Qes3 int型の変数ageに18を代入 
*   　　　     →ageが20以上なら成人ですと表示
*   　　　　　 →ageが13以上19以下ならティーンエイジャーですと表示
*   　　　　　 →ageが12以下なら子供ですと表示
*  
*****************************/			
		
         int age1 =18;
 
		 if(age1 >=20) {
			System.out.println("成人です");
		 } else if (age1 >= 13 && age1 <= 19 ) {
		    System.out.println("ティーンエイジャーです");
		 } else if (age1 <= 12) {
			 System.out.println("子供です");
		 }
			
	     
		
/*****************************
*  
*   【概要】Qes2 
*   　　　     →
*   　　　　　 →
*  
*****************************/	

		
		
/*****************************
*  
*   【概要】Qes2 
*   　　　     →
*   　　　　　 →
*  
*****************************/	
		
		
		
		
		
	}

}
